DionLegierse/ProjectPaulusma/STM32/WeatherStation/Src/main.c
}

/*
 INPUT: the input of the function requires a pointer to a buffer, with the temprature data
 stored in the first two bytes, and the length of the buffer
 The minimal amount of space required is 4 bytes.
 OUTPUT: returns a zero (ABORTED) if the buffer was not large enough and a one (SUCCES) if conversion was succcesfull
 FUNCTION: this functions takes the first two bytes in the buffer and
 converts them to a string and stores this string in the first three bytes of the buffer.
 The buffer always requires a storage space in the back for a point within the string.
 */
uint16_t convert_data_temp_to_int(uint8_t * buffer, uint8_t bufferLength) {
	uint16_t data = buffer[0] << MSB_OFFSET | buffer[1];
	return (uint16_t) roundf(((((data * 175.72) / 65536) - 46.85) * 10));
}

/*
 INPUT: the input of the function requires a pointer to a buffer, with the humidity data
 stored in the first two bytes, and the length of the buffer
 The minimal amount of space required in the buffer is 2 bytes.
 OUTPUT: returns a zero (ABORTED) if the buffer was not large enough and a one (SUCCES) if conversion was succcesfull
 FUNCTION: this functions takes the first two bytes in the buffer and
 converts them to a string and stores this string in the first two bytes of the buffer.
 */
uint16_t convert_data_humid_to_int(uint8_t * buffer, uint8_t bufferLength) {
	uint16_t data = buffer[0] << MSB_OFFSET | buffer[1];
	return (uint16_t) roundf(((((data * 125) / 65536) - 6)));
}

/* USER CODE END 4 */

//Global variables
uint16_t globalPressure = 0;
uint16_t globalTemperature = 0;
uint16_t globalHumidity = 0;

uint8_t isPressureDone = NOT_READY;
uint8_t isTemperatureDone = NOT_READY;
uint8_t isHumidityDoneFlag = NOT_READY;

/* StartTaskTemperature function */
void StartTaskTemperature(void const * argument)
{

  /* USER CODE BEGIN 5 */
	uint8_t commandLoadTemp = 0xE3;

	uint8_t buffer[ MAX_BUFFER_SIZE];

	/* Infinite loop */
	for (;;) {
		get_data_from_is7021(buffer, &commandLoadTemp, MAX_BUFFER_SIZE);
		globalTemperature = convert_data_temp_to_int(buffer, MAX_BUFFER_SIZE);
		isTemperatureDone = READY;
		vTaskSuspend(taskTemperatureHandle);
	}
  /* USER CODE END 5 */ 
}

/* startTaskHumidity function */
void startTaskHumidity(void const * argument)
{
	uint8_t commandLoadHumidity = 0xE5;

	uint8_t buffer[MAX_BUFFER_SIZE];

	/* Infinite loop */
	for (;;) {
		get_data_from_is7021(buffer, &commandLoadHumidity, MAX_BUFFER_SIZE);

		globalHumidity = convert_data_humid_to_int(buffer, MAX_BUFFER_SIZE);

		isHumidityDoneFlag = READY;
		vTaskSuspend(taskHumidityHandle);
	}
}

/* startTaskPressure function */
void startTaskPressure(void const * argument)
{
  /* USER CODE BEGIN startTaskPressure */
	/* Infinite loop */
	uint8_t buffer[MAX_BUFFER_SIZE];
	memset(buffer, '\n', MAX_BUFFER_SIZE);

	for (;;) {
		globalPressure = (uint16_t)getPressure();
		isPressureDone = READY;
		vTaskSuspend(taskPressureHandle);
	}
  /* USER CODE END startTaskPressure */
}

/* startTaskWifi function */
void startTaskWifi(void const * argument)
{
  /* USER CODE BEGIN startTaskWifi */
	char buffer[MAX_BUFFER_SIZE];
	int counter = 0;
  /* Infinite loop */
  for(;;)
  {
	  if(isHumidityDoneFlag && isPressureDone && isTemperatureDone){
		  ++counter;

		  xSemaphoreTake(UART2BusMutexHandle, STANDARD_MUTEX_TAKE_TIME);
		  sprintf(buffer, "%d degrees Celcius\n", globalTemperature);
		  HAL_UART_Transmit(&huart2, buffer, strlen(buffer), 100);

		  sprintf(buffer, "%d percent humid\n", globalHumidity);
		  HAL_UART_Transmit(&huart2, buffer, strlen(buffer), 100);

		  sprintf(buffer, "%d millibar of pressure\n", globalPressure);
		  HAL_UART_Transmit(&huart2, buffer, strlen(buffer), 100);

		  sprintf(buffer, "%d metingsronde zijn klaar\n\n", counter);
		  HAL_UART_Transmit(&huart2, buffer, strlen(buffer), 100);
		  xSemaphoreGive(UART2BusMutexHandle);

		  isHumidityDoneFlag = isPressureDone = isTemperatureDone = NOT_READY;

		  vTaskResume(taskTemperatureHandle);
		  vTaskResume(taskPressureHandle);
		  vTaskResume(taskHumidityHandle);

		  osDelay(50000);
	  }
  }
  /* USER CODE END startTaskWifi */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
